In [1]:
import sqlite3 as lite
import os
import pandas as pd

RDBMS - Relational Database Management System

SQL - Structured Query Language

DB Browser for SQLite
Lucid Chart

# SQLite

Backstory...
It was invented for military uses as a small, fast database to be used in weapon systems

It later got implemented in mobile hardware and other embedded systems due to its effeciency and speed

### Create/Load Database

In [2]:
con = lite.connect(f'BTech22_smaranrb.sqlite')

In [4]:
con.close()

#### Note:

In [ ]:
con_mem = lite.connect(":memory:")

(pd.read_excel("../BTech22.xlsx")
    .head()
    .to_sql("Smaran", con_mem index = False))

## Execute Queries:

##### Using con.execute

In [ ]:
query = "SELECT * FROM {table_name}"

return_table = con.execute(query) # This is a python Generator datatype

return_table.fetchone() # Read one rows
return_table.fetchall() # Read all rows

Using pd.read_sql / read_sql_query

In [ ]:
pd.read_sql_query(query, com) # Returns a dataframe

In [ ]:
query = ''' insert into table values (?, ?, ?, ?, ?)'''
con.executemany(query, list_of_data)

con.commit()

In [ ]:
query

In [1]:
import sqlite_dump

In [ ]:
with lite.connect("<path>") as con:
    with open('<path of file>.sql', 'w') as f_out:
        for line in con.iterdump():
            f_out.erite(f'{line}\n')

In [ ]:
open("<path>").readlines() # contents of files in list pf strings 
open("<path>").read() # contents of file in one single string

In [ ]:
import csv

In [ ]:
file = open('<filename>.csv')
contents = list(csv.reader(file))

# Size of contents
print(np.shape(contents), contents, sep = "\n")

In [ ]:
sql_insert_csv = """
INSERT INTO <TABLE> 
VALUES (?,?,...)
"""
con.execute(sql_insert_csv, contents)

In [3]:
from sqlite_dump import iterdump

In [7]:
try:
    with open('BTech22_backup.txt', 'w') as wtxt:
        wtxt.writelines(list(iterdump(con)))
except:
    pass

## SQL String Functions

In [ ]:
f'''
TRIM({field}) - strip() function - trim out all the extra spaces on the left and right ends of the sring 
    LTRIM() - lstrip()
    RTRIM() - rstrip()

UPPER({field}) - upper() function

SUBSTR({field, x, y}) - 

'''

### For temporary presentation purposes, hange the values of a column using if else

In [ ]:
sql = """
  SELECT name, Section,
    CASE sex                       -- start transformation
       WHEN 'Female' THEN 'Girl'
       ELSE 'Boy'
    END sex,                       -- end
    Height_cm, Weight_Kg
  FROM Students
  LIMIT 10
"""
pd.read_sql(sql, con)

                  Name Section   sex  Height_cm  Weight_Kg
0     SHREE VYSHNAVI A       B  Girl        158         56
1  AARON ARTHUR ELISHA       A   Boy        183         76
2             ABHISHEK       A   Boy        181         56
3        ABRAR HUSSAIN       B   Boy        182         69
4              ADITI A       B  Girl        157         61
5          ADITYA GARG       C   Boy        182         60
6       ADITYA ADUKURI       B   Boy        171         75
7        ADITYA KUSHAL       A   Boy        176         61
8             ADITYA P       A   Boy        170         55
9        ADITYA RAJU A       A   Boy        172         75

# Indexing

In [3]:
def find_operation():
    pd.read_sql("SELECT * FROM Students WHERE USN LIKE '1RVU22CSE157'", con)

Time performance Without index

In [6]:
con.execute("DROP INDEX IF EXISTS USN;")
print("Performance without index")    
%timeit find_operation()

Performance without index
3.29 ms ± 264 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

Time performance With index

In [7]:
con.execute("CREATE INDEX IF NOT EXISTS USN ON Students (USN);")
print("Performance with index")  
%timeit find_operation()

Performance with index
3.21 ms ± 265 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [8]:
con.close()